{"SLAM": [{"id": "2305.01599", "title": "EgoLocate: Real-time Motion Capture, Localization, and Mapping with Sparse Body-mounted Sensors", "url": "http://arxiv.org/pdf/2305.01599.pdf", "time": "2023-05-02", "code": "https://xinyu-yi.github.io/EgoLocate/", "context": ["EgoLocate is a system that integrates inertial sensors and cameras for real-time human motion capture, localization, and mapping. It uses image-based SLAM for localization and inertial mocap for camera motion prior, improving localization accuracy compared to state of the art techniques. The code is available for research at https://xinyu-yi.github.io/EgoLocate/.", "EgoLocate系统将惯性传感器和相机集成在一起，用于实时人体运动捕捉、定位和建图。它使用基于图像的SLAM进行定位，使用惯性mocap提供相机运动先验，相比于现有技术，提高了定位精度。我们的代码可在https://xinyu-yi.github.io/EgoLocate/上获取。"]}, {"id": "2305.00406", "title": "LIMOT: A Tightly-Coupled System for LiDAR-Inertial Odometry and Multi-Object Tracking", "url": "http://arxiv.org/pdf/2305.00406.pdf", "time": "2023-04-30", "code": null, "context": ["This study proposes LIMOT, a tightly-coupled multi-object tracking and LiDAR-inertial SLAM system for autonomous driving. LIMOT uses 3D bounding boxes generated by an object detector and performs LiDAR odometry using IMU pre-integration. Object association is performed based on historical trajectories of tracked objects. A trajectory-based dynamic feature filtering method is used to filter out features belonging to moving objects. Factor graph-based optimization is then conducted to optimize IMU bias and pose estimation. Experiments show that LIMOT achieves better pose and tracking accuracy than baseline methods. Code is not provided.", "该研究提出了一种紧密耦合的多目标跟踪和LiDAR惯性SLAM系统LIMOT，适用于自动驾驶。LIMOT使用由目标检测器生成的三维边界框，并使用IMU预积分进行LiDAR里程计计算。基于跟踪对象的历史轨迹，执行鲁棒的对象关联。采用基于轨迹的动态特征过滤方法来过滤属于移动对象的特征。然后进行因子图优化，以优化IMU偏差和姿态估计。实验表明，LIMOT比基准方法具有更好的姿态和跟踪精度。未提供代码。"]}, {"id": "2305.00348", "title": "Modality-invariant Visual Odometry for Embodied Vision", "url": "http://arxiv.org/pdf/2305.00348.pdf", "time": "2023-04-29", "code": null, "context": ["This study proposes a Transformer-based modality-invariant Visual Odometry (VO) approach that can deal with diverse or changing sensor suites of navigation agents. The model outperforms previous methods while training on only a fraction of the data. This method opens the door to a broader range of real-world applications that can benefit from flexible and learned VO models. Code is not provided.", "本研究提出了一种基于Transformer的模态不变Visual Odometry（VO）方法，可以处理导航代理的多样化或变化的传感器套件。该模型在只使用部分数据进行训练的情况下优于先前的方法。该方法为更广泛的实际应用开启了大门，可以从灵活和学习到的VO模型中受益。未提供代码。"]}, {"id": "2304.14560", "title": "Neural Implicit Dense Semantic SLAM", "url": "http://arxiv.org/pdf/2304.14560.pdf", "time": "2023-04-27", "code": null, "context": ["This paper presents an efficient online framework for solving the semantic Visual Simultaneous Localization and Mapping (V-SLAM) problem for indoor scenes using neural implicit scene representation. The proposed method disentangles tracking and 3D mapping pipeline for computing robust and accurate camera motion. Dense and multifaceted scene representation is provided using neural fields for SDF, semantics, RGB, and depth. The set of keyframes is shown to be sufficient for learning excellent scene representation, thereby improving the pipeline\\'s train time. Multiple local mapping networks can be used to extend the pipeline for large-scale scenes. Extensive experiments show accurate tracking, mapping, and semantic labeling with noisy and sparse depth measurements. The pipeline can also easily extend to RGB image input. Code is not provided.", "本文提出了一种使用神经隐式场景表示法解决语义视觉同时定位和地图构建（V-SLAM）问题的高效在线框架，适用于室内场景。所提出的方法将跟踪和3D映射流水线区分开来，用于计算稳健且准确的相机运动。使用神经场提供SDF、语义、RGB和深度的密集多面场景表示。通过实验表明，关键帧集合足以学习出优秀的场景表示，从而提高了流水线的训练时间，同时可以使用多个本地映射网络来扩展大规模场景的流水线。在多个基准数据集上进行了广泛实验，证明了该方法可以在噪声和稀疏深度测量的情况下进行准确的跟踪、地图构建和语义标注。该流水线也可以轻松扩展到RGB图像输入。未提供代码。"]}, {"id": "2304.14377", "title": "Co-SLAM: Joint Coordinate and Sparse Parametric Encodings for Neural Real-Time SLAM", "url": "http://arxiv.org/pdf/2304.14377.pdf", "time": "2023-04-27", "code": null, "context": ["This paper presents Co-SLAM, a neural RGB-D SLAM system based on a hybrid representation that performs real-time and robust camera tracking and high-fidelity surface reconstruction. Co-SLAM uses a multi-resolution hash-grid representation and one-blob encoding to exploit high convergence speed and ability to represent high-frequency local features, encouraging surface coherence and completion in unobserved areas. The joint parametric-coordinate encoding brings the best of both worlds: fast convergence and surface hole filling. Co-SLAM also performs global bundle adjustment over all keyframes, allowing for state-of-the-art scene reconstruction results and competitive tracking performance in various datasets and benchmarks. Project page: https://hengyiwang.github.io/projects/CoSLAM. Code is not provided.", "本文提出了Co-SLAM，一种基于混合表示的神经RGB-D SLAM系统，可实现实时和稳健的相机跟踪和高保真度表面重建。Co-SLAM使用多分辨率哈希网格表示和“one-blob”编码，以利用高收敛速度和能够表示高频局部特征的能力，鼓励表面的连续性和完成性。联合参数坐标编码将快速收敛和表面孔填充的优点结合起来。Co-SLAM还在所有关键帧上执行全局束调整，从而实现了最先进的场景重建结果和各种数据集和基准测试中的竞争跟踪性能。项目页面：https://hengyiwang.github.io/projects/CoSLAM。未提供代码。"]}], "NeRF": [{"id": "2305.01643", "title": "Neural LiDAR Fields for Novel View Synthesis", "url": "http://arxiv.org/pdf/2305.01643.pdf", "time": "2023-05-02", "code": null, "context": ["This paper presents Neural Fields for LiDAR (NFL), a method that optimizes a neural field scene representation from LiDAR measurements to synthesize realistic LiDAR scans from novel viewpoints. NFL combines the rendering power of neural fields with a physically motivated model of the LiDAR sensing process, accurately reproducing key sensor behaviors like beam divergence, secondary returns, and ray dropping. The method outperforms explicit reconstruct-then-simulate methods as well as other NeRF-style methods on LiDAR novel view synthesis tasks, as shown on both synthetic and real LiDAR scans. The improved realism of the synthesized views narrows the domain gap to real scans, resulting in better registration and semantic segmentation performance. Code is not provided.", "本文提出了用于LiDAR的神经场（NFL）方法，该方法从LiDAR测量中优化神经场场景表示，以从新视点合成逼真的LiDAR扫描。NFL将神经场的渲染能力与LiDAR感知过程的详细物理模型相结合，可以准确地再现关键传感器行为，如光束发散、二次回波和光线丢失。该方法在合成和真实LiDAR扫描上的表现均优于显式重建-模拟方法以及其他NeRF风格的LiDAR新视点合成方法。此外，我们证明合成视图的改进逼真度缩小了与真实扫描之间的领域差距，并转化为更好的配准和语义分割性能。未提供代码。"]}, {"id": "2305.01190", "title": "LatentAvatar: Learning Latent Expression Code for Expressive Neural Head Avatar", "url": "http://arxiv.org/pdf/2305.01190.pdf", "time": "2023-05-02", "code": null, "context": ["This paper presents LatentAvatar, an expressive neural head avatar driven by latent expression codes learned in an end-to-end and self-supervised manner without templates. Existing approaches to animatable NeRF-based head avatars are heavily bound by the expression power and tracking accuracy of templates. LatentAvatar leverages a latent head NeRF to learn person-specific latent expression codes from monocular portrait videos and uses a Y-shaped network to learn shared latent expression codes of different subjects for cross-identity reenactment. By optimizing photometric reconstruction objectives in NeRF, the learned latent expression codes are 3D-aware and capture high-frequency detailed expressions, enabling LatentAvatar to perform expressive reenactment between different subjects. Experimental results show that LatentAvatar outperforms previous state-of-the-art solutions in both quantitative and qualitative comparisons, capturing challenging expressions and subtle movements of teeth and eyeballs. Project page: https://www.liuyebin.com/latentavatar. Code is not provided.", "本文提出了一种表情自适应的神经头像生成方法LatentAvatar，其通过学习端到端和自监督的方式，使用潜在表情编码来驱动神经元渲染形式的头像生成。现有的基于NeRF的头像生成方法往往依赖于面部模板或使用表情系数作为驱动信号，其性能受到模板表情和跟踪精度的限制。LatentAvatar利用潜在头部NeRF从单目肖像视频中学习特定个体的潜在表情编码，并使用Y形网络学习不同主体的共享潜在表情编码，以实现跨身份重现。通过在NeRF中优化光度重建目标，学习的潜在表情编码具有3D感知能力，能够捕捉高频细节表情，使LatentAvatar能够在不同主体之间进行表情重现。实验结果表明，LatentAvatar在定量和定性比较中均优于先前的最先进解决方案，能够捕捉具有挑战性的表情和牙齿、眼球的微小运动。项目页面：https://www.liuyebin.com/latentavatar。未提供代码。"]}, {"id": "2305.01163", "title": "Federated Neural Radiance Fields", "url": "http://arxiv.org/pdf/2305.01163.pdf", "time": "2023-05-02", "code": null, "context": ["This paper presents a federated learning approach to training neural radiance fields (NeRFs) for scene representation. Previous approaches have relied on centralized learning, assuming that all training images are available on one compute node. In contrast, this paper considers federated learning, where multiple compute nodes each having acquired a distinct set of observations learn a common NeRF in parallel. This supports the scenario of cooperatively modeling a scene using multiple agents. The contribution is the first federated learning algorithm for NeRF that splits the training effort across multiple compute nodes and avoids the need to pool images at a central node. A technique based on low-rank decomposition of NeRF layers is introduced to reduce bandwidth consumption for aggregating model parameters. Transferring compressed models instead of raw data also enhances the privacy of the data collecting agents. Code is not provided.", "本文提出了一种基于联邦学习的方法，用于训练神经辐射场（NeRF）进行场景表示。先前的方法依赖于集中式学习，假定所有的训练图像都在一个计算节点上可用。相比之下，本文考虑了联邦学习，其中多个计算节点分别获取不同的观察数据，以并行方式学习共同的NeRF。这支持了使用多个代理协同建模场景的情况。本文的贡献是第一个针对NeRF的联邦学习算法，它将训练工作分布在多个计算节点上，并避免了在中心节点汇总图像的需要。引入了一种基于NeRF层的低秩分解技术，以减少聚合模型参数的带宽消耗。与其传输原始数据，传输压缩模型还可以提高数据收集代理的隐私性。未提供代码。"]}, {"id": "2305.00787", "title": "GeneFace++: Generalized and Stable Real-Time Audio-Driven 3D Talking Face Generation", "url": "http://arxiv.org/pdf/2305.00787.pdf", "time": "2023-05-01", "code": null, "context": ["This paper addresses the challenge of generating talking person portraits with arbitrary speech audio, which is crucial for digital human and metaverse applications. The goal is to achieve generalized audio-lip synchronization, good video quality, and high system efficiency. Neural radiance field (NeRF) has become a popular rendering technique in this field due to its high-fidelity and 3D-consistent talking face generation capabilities with a few-minute-long training video. However, there are still several challenges for NeRF-based methods, including lip synchronization, video quality, and system efficiency. This paper proposes GeneFace++ to address these challenges by utilizing pitch contour as an auxiliary feature and introducing a temporal loss, proposing a landmark locally linear embedding method to regulate outliers in the predicted motion sequence, and designing a computationally efficient NeRF-based motion-to-video renderer for fast training and real-time inference. GeneFace++ is the first NeRF-based method that achieves stable and real-time talking face generation with generalized audio-lip synchronization. Extensive experiments show that GeneFace++ outperforms state-of-the-art baselines in both subjective and objective evaluation. Video samples are available at https://genefaceplusplus.github.io. Code is not provided.", "本文解决了使用任意语音音频生成说话人头像的挑战，这对数字人和元宇宙应用至关重要。目标是实现广义音频嘴唇同步、良好的视频质量和高系统效率。神经辐射场（NeRF）由于具有高保真度和3D一致的说话人脸生成能力而成为该领域的流行渲染技术，仅需几分钟的训练视频。然而，NeRF方法仍然存在一些挑战，包括嘴唇同步、视频质量和系统效率。本文提出了GeneFace++来解决这些挑战，通过将基频轮廓作为辅助特征并在面部运动预测过程中引入时间损失，提出了一个地标局部线性嵌入方法来调节预测运动序列中的异常值以避免鲁棒性问题，并设计了一个计算效率高的NeRF运动到视频渲染器以实现快速训练和实时推理。GeneFace++是第一个实现稳定和实时的NeRF方法，可以实现广义音频嘴唇同步的说话人脸生成。广泛的实验结果表明，GeneFace++在主观和客观评估方面优于最先进的基线方法。视频样本可在https://genefaceplusplus.github.io上获得。未提供代码。"]}, {"id": "2305.00375", "title": "Neural Radiance Fields (NeRFs): A Review and Some Recent Developments", "url": "http://arxiv.org/pdf/2305.00375.pdf", "time": "2023-04-30", "code": null, "context": ["Neural Radiance Field (NeRF) is a framework that represents a 3D scene using a fully connected neural network, known as the Multi-Layer Perception (MLP). It was introduced for the task of novel view synthesis and is capable of achieving state-of-the-art photorealistic image renderings from a given continuous viewpoint. NeRFs have become a popular field of research, as recent developments have expanded the performance and capabilities of the base framework. These developments include methods that require less images to train the model for view synthesis, as well as methods that are able to generate views from unconstrained and dynamic scene representations.", "神经辐射场（NeRF）是一种框架，它使用全连接神经网络（称为多层感知器，MLP）来表示3D场景。它被引入用于新视角合成任务，并能够从给定的连续视角实现最先进的逼真图像渲染。随着最近的发展，NeRF已成为研究的热门领域，这些发展扩展了基本框架的性能和功能。这些发展包括需要更少的图像来训练视角合成模型的方法，以及能够从无约束和动态场景表示生成视图的方法。"]}]}