{"SLAM": [{"id": "2305.02645", "title": "Edge-aware Consistent Stereo Video Depth Estimation", "url": "http://arxiv.org/pdf/2305.02645.pdf", "time": "2023-05-04", "code": null, "context": ["We propose a consistent method for dense video depth estimation using stereo videos and a left-right consistency loss to improve performance. Our edge-aware stereo video model can accurately estimate dense depth maps.", "我们提出了一种一致的方法，使用立体视频和左右一致性损失来提高性能，进行密集视频深度估计。我们的边缘感知立体视频模型可以准确地估计密集深度图。"]}], "NeRF": [{"id": "2305.03049", "title": "NeuralEditor: Editing Neural Radiance Fields via Manipulating Point Clouds", "url": "http://arxiv.org/pdf/2305.03049.pdf", "time": "2023-05-04", "code": "https://github.com/immortalco/NeuralEditor", "context": ["This paper proposes NeuralEditor, which allows for shape editing of neural radiance fields (NeRFs) through explicit point cloud representation and a novel rendering scheme. NeuralEditor achieves state-of-the-art performance in shape deformation and scene morphing tasks, and supports zero-shot inference and fine-tuning. Code, benchmark, and demo video are available at https://immortalco.github.io/NeuralEditor.", "本文提出了NeuralEditor，它通过显式点云表示和新颖的渲染方案，使神经辐射场（NeRFs）可进行形状编辑。NeuralEditor在形状变形和场景变形任务上实现了最先进的性能，并支持零样本推理和微调。代码、基准测试和演示视频可在https://immortalco.github.io/NeuralEditor获得。"]}, {"id": "2305.02756", "title": "Radiance Field Gradient Scaling for Unbiased Near-Camera Training", "url": "http://arxiv.org/pdf/2305.02756.pdf", "time": "2023-05-04", "code": null, "context": ["This work proposes a gradient scaling approach to counter the sampling bias in NeRF acquisition that causes background collapse and floating artifacts. Our method removes the need for near planes and is compatible with most NeRF implementations. It can be implemented in a few lines with no significant overhead.", "本文提出了一种梯度缩放方法，以抵消NeRF采集中的采样偏差，从而防止背景坍塌和浮动伪影。我们的方法不需要近平面，可以在大多数NeRF实现中使用，且仅需几行代码即可实现，没有任何显著的额外开销。"]}, {"id": "2305.02618", "title": "Semantic-aware Generation of Multi-view Portrait Drawings", "url": "http://arxiv.org/pdf/2305.02618.pdf", "time": "2023-05-04", "code": "https://github.com/AiArt-HDU/SAGE", "context": ["This paper proposes a Semantic-Aware GEnerator (SAGE) for synthesizing multi-view portrait drawings, overcoming the limitations of NeRF-based methods in generating such drawings. SAGE collaboratively synthesizes multi-view semantic maps and corresponding portrait drawings using facial semantic labels. A semantic-aware domain translator facilitates training, and data augmentation via synthesis mitigates collapsed results. SAGE achieves superior or highly competitive performance compared to existing 3D-aware image synthesis methods. Code is available at https://github.com/AiArt-HDU/SAGE.", "本文提出了一种语义感知生成器（SAGE），用于合成多视角肖像画，克服了基于NeRF的方法在生成此类画作中的局限性。SAGE使用面部语义标签协同合成多视角语义地图和相应的肖像画。语义感知域转换器促进了训练，而通过合成进行的数据增强则减少了坍塌的结果。实验结果表明，与现有的3D感知图像合成方法相比，SAGE的性能明显优越或高度竞争。代码可在https://github.com/AiArt-HDU/SAGE获得。"]}]}