{"SLAM": [{"id": "2305.07299", "title": "An Object SLAM Framework for Association, Mapping, and High-Level Tasks", "url": "http://arxiv.org/pdf/2305.07299.pdf", "time": "2023-05-12", "code": null, "context": ["This paper presents a comprehensive object SLAM framework that focuses on object-based perception and object-oriented robot tasks. The framework proposes an ensemble data association approach, an outlier-robust centroid and scale estimation algorithm, and a lightweight and object-oriented map. The object map is converted to a topological map and an object-driven active exploration strategy is suggested. The proposed framework is evaluated using public datasets and real-world results for its efficient performance.", "本文提出了一个全面的基于对象的SLAM框架，侧重于基于对象的感知和面向对象的机器人任务。该框架提出了一个集合数据关联方法、一个鲁棒的离群点质心和尺度估计算法以及一个轻量级的基于对象的地图。将对象地图转换为拓扑地图，并建议采用基于对象的主动探索策略来实现抓取场景下的自主建图。使用公共数据集和真实世界结果评估所提出的对象SLAM框架的高效性。"]}, {"id": "2305.07154", "title": "Foundations of Spatial Perception for Robotics: Hierarchical Representations and Real-time Systems", "url": "http://arxiv.org/pdf/2305.07154.pdf", "time": "2023-05-11", "code": "https://github.com/MIT-SPARK/Hydra", "context": ["This paper introduces Hydra, a real-time spatial perception system that builds a 3D scene graph from visual-inertial data by combining 3D geometry, topology, and geometric deep learning. The paper proposes hierarchical representations for scalable spatial perception and discusses their structure and properties. Algorithms for incremental construction and long-term maintenance of 3D scene graphs are presented, including hierarchical descriptors for loop closure detection and a 3D scene graph optimization problem. Hydra is evaluated in photo-realistic simulations and real data and an open-source implementation is provided.", "本文介绍了Hydra，这是一个实时的空间感知系统，通过结合3D几何、拓扑和几何深度学习，建立了一个3D情景图。本文提出了一种分层表示方法，用于可扩展的空间感知，并讨论了其结构和属性。介绍了增量构建和长期维护3D情景图的算法，包括用于回路闭合检测的分层描述符和3D情景图优化问题的解决方案。Hydra在照片逼真的模拟和真实数据中进行了评估，并提供了开源实现。"]}], "NeRF": [{"id": "2305.07342", "title": "BundleRecon: Ray Bundle-Based 3D Neural Reconstruction", "url": "http://arxiv.org/pdf/2305.07342.pdf", "time": "2023-05-12", "code": null, "context": ["This paper proposes BundleRecon, an enhanced neural implicit multi-view reconstruction model that samples a patch of pixels using a bundle of rays to leverage information from neighboring pixels. Bundle-based constraints are also designed to further improve reconstruction quality. Experimental results show that BundleRecon is compatible with existing methods and can improve reconstruction quality.", "本文提出了BundleRecon，这是一个增强的神经隐式多视图重建模型，通过使用一束光线采样一组像素来利用相邻像素的信息。此外，我们设计了基于束的约束来进一步提高重建质量。实验结果表明，BundleRecon与现有的神经隐式多视图重建方法兼容，并且可以提高重建质量。"]}]}