{"SLAM": [], "NeRF": [{"id": "2305.06131", "title": "Generative AI meets 3D: A Survey on Text-to-3D in AIGC Era", "url": "http://arxiv.org/pdf/2305.06131.pdf", "time": "2023-05-10", "code": null, "context": ["This piece discusses the progress made in generative AI, specifically text-guided content generation and the emerging field of text-to-3D. The article provides a comprehensive survey of text-to-3D, including 3D data representations, foundational technologies, recent works, and various applications.", "本文讨论了生成式人工智能的进展，特别是以文本为导向的内容生成和新兴的文本到三维领域。文章提供了关于文本到三维的全面调查，包括三维数据表示、基础技术、最近的研究和各种应用。"]}, {"id": "2305.06118", "title": "NeRF$^\\textbf{2}$: Neural Radio-Frequency Radiance Fields", "url": "http://arxiv.org/pdf/2305.06118.pdf", "time": "2023-05-10", "code": null, "context": ["This piece discusses the use of a neural radio-frequency radiance field, NeRF$^\\textbf{2}$, to model the propagation of RF signals in complex environments. The NeRF$^\\textbf{2}$ can generate a synthetic dataset that can improve the performance of application-layer artificial neural networks (ANNs) via turbo-learning. The article also demonstrates the power of NeRF$^\\textbf{2}$ in indoor localization and 5G MIMO.", "本文讨论使用神经射频辐射场NeRF$^\\textbf{2}$来模拟复杂环境中射频信号的传播。NeRF$^\\textbf{2}$可以生成一个合成数据集，通过turbo-learning来提高应用层人工神经网络（ANNs）的性能。本文还展示了NeRF$^\\textbf{2}$在室内定位和5G MIMO领域的应用。"]}, {"id": "2305.05766", "title": "Instant-NeRF: Instant On-Device Neural Radiance Field Training via Algorithm-Accelerator Co-Designed Near-Memory Processing", "url": "http://arxiv.org/pdf/2305.05766.pdf", "time": "2023-05-09", "code": null, "context": ["This piece discusses the development of a near-memory processing (NMP) framework, Instant-NeRF, dedicated to enabling instant on-device Neural Radiance Fields (NeRFs) training for immersive AR/VR experiences. The article highlights the unique workloads of NeRFs and the challenges faced by NMP, but shows that experiments on eight datasets consistently validate the effectiveness of Instant-NeRF.", "本文讨论了一种近存储器处理（NMP）框架Instant-NeRF的开发，该框架专门用于实现即时的设备端神经辐射场（NeRFs）训练，以实现沉浸式AR/VR体验。文章强调了NeRFs的独特工作负载和NMP面临的挑战，但是实验结果表明Instant-NeRF在八个数据集上的有效性始终得到验证。"]}]}